funny = {'а': 'λ', 'б': 'Ҕ', 'в': 'ß', 'г': 'ℾ', 'д': '∂', 'е': 'ໂ', 'ж': '氺',
         'з': 'Յ', 'и': 'ท', 'й': 'ท', 'к': 'ᛕ', 'л': 'በ', 'м': 'ጠ', 'н': 'ਮ',
         'о': '∅', 'п': 'ㄇ', 'р': 'թ', 'с': '₡', 'т': 'ͳ', 'у': 'ɤ', 'ф': 'փ',
         'х': 'メ', 'ц': 'Ա', 'ь': '♭', 'ы': 'ӹ', 'ъ': 'ѣ', 'ш': 'ሠ', 'ч': 'Կ',
         'щ': 'ሠ', 'э': '∍', 'ю': 'ਠ', 'я': 'я', 'ё': 'ໂ', }


chinese = {'а': '闩', 'б': '五', 'в': '乃', 'г': '厂', 'д': '亼', 'е': '仨', 
           'ж': '水', 'з': '弓', 'и': '订', 'й': '订', 'к': '长', 'л': '几', 
           'м': '从', 'н': '卄', 'о': '口', 'п': '冂', 'р': '卩', 'с': '匚',
           'т': '丁', 'у': '丫', 'ф': '中', 'х': '乂', 'ц': '凵', 'ь': 'Ь', 
           'ы': '辷', 'ъ': 'Ь', 'ш': '山', 'ч': '丩', 'щ': '山', 'э': '彐',
           'ю': '扣', 'я': '牙', 'ё': '庄'}


def to_funny_font(t):
    res = ''
    
    for i in t:
        if i in funny:
            res += funny[i]
        else:
            res += i
    return res

def to_chinese_font(t):
    res = ''
    
    for i in t:
        if i in chinese:
            res += chinese[i]
        else:
            res += i
    return res